Repository: cwahlfeldt/bulk-post-importer
Catalog: languages/bulk-post-importer-*.po
Languages: es_es

source: Bulk Post Importer
es_es: Importador Masivo de Entradas

source: You do not have sufficient permissions to access this page.
es_es: No tienes permisos suficientes para acceder a esta página.

source: Security check failed. Please try again.
es_es: Falló la verificación de seguridad. Por favor, inténtalo de nuevo.

source: Security check failed. Please start over.
es_es: Falló la verificación de seguridad. Por favor, comienza de nuevo.

source: Missing required data (transient key, post type, or mapping info). Please start over.
es_es: Faltan datos requeridos (clave transitoria, tipo de entrada o información de mapeo). Por favor, comienza de nuevo.

source: Title
es_es: Título

source: Required
es_es: Requerido

source: Content
es_es: Contenido

source: Converted to Paragraph Blocks
es_es: Convertido a Bloques de Párrafo

source: Excerpt
es_es: Extracto

source: Status (e.g., publish, draft)
es_es: Estado (ej. publicado, borrador)

source: Date (YYYY-MM-DD HH:MM:SS)
es_es: Fecha (AAAA-MM-DD HH:MM:SS)

source: No error, file uploaded successfully.
es_es: Sin errores, archivo subido exitosamente.

source: The uploaded file exceeds the upload_max_filesize directive in php.ini.
es_es: El archivo subido excede la directiva upload_max_filesize en php.ini.

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form.
es_es: El archivo subido excede la directiva MAX_FILE_SIZE especificada en el formulario HTML.

source: The uploaded file was only partially uploaded.
es_es: El archivo solo se subió parcialmente.

source: No file was uploaded.
es_es: No se subió ningún archivo.

source: Missing a temporary folder on the server.
es_es: Falta una carpeta temporal en el servidor.

source: Failed to write file to disk on the server.
es_es: Falló la escritura del archivo al disco en el servidor.

source: A PHP extension stopped the file upload.
es_es: Una extensión PHP detuvo la subida del archivo.

source: Unknown upload error occurred.
es_es: Ocurrió un error de subida desconocido.

source: Invalid post type selected.
es_es: Tipo de entrada seleccionado inválido.

source: File upload error: %s
es_es: Error de subida de archivo: %s

source: Invalid file type. Please upload a .json file (detected type: %s).
es_es: Tipo de archivo inválido. Por favor, sube un archivo .json (tipo detectado: %s).

source: Could not read the uploaded file.
es_es: No se pudo leer el archivo subido.

source: JSON Decode Error: %s. Please ensure the file is valid UTF-8 encoded JSON.
es_es: Error de decodificación JSON: %s. Por favor, asegúrate de que el archivo sea JSON válido codificado en UTF-8.

source: JSON file structure error: Root element must be an array [...].
es_es: Error de estructura del archivo JSON: El elemento raíz debe ser un array [...].

source: The JSON file appears to contain an empty array.
es_es: El archivo JSON parece contener un array vacío.

source: JSON file structure error: The array should contain objects {...}.
es_es: Error de estructura del archivo JSON: El array debe contener objetos {...}.

source: Import data expired or was invalid. Please start over.
es_es: Los datos de importación expiraron o fueron inválidos. Por favor, comienza de nuevo.

source: Post type mismatch between steps. Please start over.
es_es: Discrepancia en el tipo de entrada entre pasos. Por favor, comienza de nuevo.

source: Item #%d: Skipped - Invalid data format (expected object/array).
es_es: Elemento #%d: Omitido - Formato de datos inválido (se esperaba objeto/array).

source: Item #%d: Skipped - Missing required field mapping or value for: Title (post_title).
es_es: Elemento #%d: Omitido - Falta mapeo de campo requerido o valor para: Título (post_title).

source: Item #%d: Failed to create post - %s
es_es: Elemento #%d: Falló al crear entrada - %s

source: Item #%d: Notice - Invalid status "%s" provided for post_status, using default "publish".
es_es: Elemento #%d: Aviso - Estado inválido "%s" proporcionado para post_status, usando por defecto "publish".

source: Item #%d: Notice - Could not parse date "%s" for post_date, using current time.
es_es: Elemento #%d: Aviso - No se pudo analizar la fecha "%s" para post_date, usando la hora actual.

source: Item #%d (Post ID %d): Notice - ACF update potentially failed for field "%s". Check data format in JSON.
es_es: Elemento #%d (ID de Entrada %d): Aviso - La actualización ACF posiblemente falló para el campo "%s". Revisa el formato de datos en JSON.

source: Bulk Post Importer from JSON - Step 1: Upload
es_es: Importador Masivo de Entradas desde JSON - Paso 1: Subir

source: Upload a JSON file containing an array of objects. Each object will represent a post.
es_es: Sube un archivo JSON que contenga un array de objetos. Cada objeto representará una entrada.

source: JSON File
es_es: Archivo JSON

source: Must be a valid JSON file containing an array of objects.
es_es: Debe ser un archivo JSON válido que contenga un array de objetos.

source: Target Post Type
es_es: Tipo de Entrada Objetivo

source: Select the post type you want to create.
es_es: Selecciona el tipo de entrada que quieres crear.

source: Upload and Proceed to Mapping
es_es: Subir y Proceder al Mapeo

source: Bulk Post Importer - Step 2: Field Mapping
es_es: Importador Masivo de Entradas - Paso 2: Mapeo de Campos

source: File: %s
es_es: Archivo: %s

source: Found %1$d items to import as "%2$s" posts. Please map the JSON keys (left) to the corresponding WordPress fields (right).
es_es: Se encontraron %1$d elementos para importar como entradas "%2$s". Por favor, mapea las claves JSON (izquierda) a los campos correspondientes de WordPress (derecha).

source: Unmapped fields will be ignored or set to default values (e.g., status defaults to "publish", date to current time).
es_es: Los campos no mapeados serán ignorados o establecidos a valores por defecto (ej. el estado por defecto es "publish", la fecha a la hora actual).

source: Standard Fields
es_es: Campos Estándar

source: JSON Key
es_es: Clave JSON

source: WordPress Field
es_es: Campo de WordPress

source: -- Do Not Map --
es_es: -- No Mapear --

source: Mapping a title is highly recommended.
es_es: Se recomienda encarecidamente mapear un título.

source: Newline characters in source will create separate Paragraph blocks.
es_es: Los caracteres de nueva línea en el origen crearán bloques de Párrafo separados.

source: Advanced Custom Fields (ACF)
es_es: Campos Personalizados Avanzados (ACF)

source: Map JSON keys to available ACF fields for this post type.
es_es: Mapea las claves JSON a los campos ACF disponibles para este tipo de entrada.

source: Note: Complex fields like Repeaters, Galleries, Relationships, Files, or Images require the JSON data to be in the specific format ACF expects (e.g., Attachment IDs for images/files, Post IDs for relationships, structured arrays for repeaters). Basic text/number/choice fields are handled directly.
es_es: Nota: Los campos complejos como Repetidores, Galerías, Relaciones, Archivos o Imágenes requieren que los datos JSON estén en el formato específico que ACF espera (ej. IDs de Adjuntos para imágenes/archivos, IDs de Entradas para relaciones, arrays estructurados para repetidores). Los campos básicos de texto/número/selección se manejan directamente.

source: ACF Field
es_es: Campo ACF

source: No ACF field groups were found assigned to this post type.
es_es: No se encontraron grupos de campos ACF asignados a este tipo de entrada.

source: Other Custom Fields (Non-ACF Post Meta)
es_es: Otros Campos Personalizados (Meta de Entrada No-ACF)

source: Map JSON keys to standard WordPress custom field names (meta keys). Use this for meta fields NOT managed by ACF.
es_es: Mapea las claves JSON a nombres de campos personalizados estándar de WordPress (claves meta). Usa esto para campos meta NO gestionados por ACF.

source: Custom Field Name (Meta Key)
es_es: Nombre del Campo Personalizado (Clave Meta)

source: Action
es_es: Acción

source: Enter meta key
es_es: Introduce clave meta

source: Remove
es_es: Eliminar

source: Add Another Custom Field Mapping
es_es: Añadir Otro Mapeo de Campo Personalizado

source: Process Import
es_es: Procesar Importación

source: Bulk Post Importer - Import Results
es_es: Importador Masivo de Entradas - Resultados de Importación

source: Import process completed for file %1$s in %2$s seconds. %3$d posts imported successfully.
es_es: Proceso de importación completado para el archivo %1$s en %2$s segundos. %3$d entradas importadas exitosamente.

source: %d item was skipped.
es_es: %d elemento fue omitido.

source: See details below.
es_es: Ver detalles abajo.

source: Import Log (Errors & Notices)
es_es: Registro de Importación (Errores y Avisos)

source: Import Another File
es_es: Importar Otro Archivo

source: File size is too large. Please upload a file smaller than 10MB.
es_es: El archivo es demasiado grande. Por favor, sube un archivo menor a 10MB.

source: Please upload a valid JSON file.
es_es: Por favor, sube un archivo JSON válido.
